src/cf/InformationRegisters/эв_ВыгруженныеОстаткиПорталов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_ВыгруженныеОстаткиПорталов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсточникЗаказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.эв_ИсточникиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул характеристики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Декларант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_МаркируемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганВыдавшийСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганЗарегистрировавшийДекларацию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СерияПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СертификатСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Фальсификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/эв_ОбменСПорталамиАптекаМос/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ВыгрузитьОстатки(Источник, НастройкиAPI, ПолнаяВыгрузка) Экспорт

	Если Не ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.АптекаМос", УровеньЖурналаРегистрации.Предупреждение, , Источник,
			"Не заполнены настройки API АптекаМос");
		Возврат Ложь;
	КонецЕсли;

	ТаблицаОстатков = ПолучитьОстаткиЦены(Источник, НастройкиAPI, ПолнаяВыгрузка);
	ТаблицаКОтправке = ТаблицаОстатков.СкопироватьКолонки();
	МассивЦен = СформироватьМассивЦен(ТаблицаОстатков, НастройкиAPI, ТаблицаКОтправке);

	Если МассивЦен.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("bilUserLogin", НастройкиAPI.ЛогинФТП);
	ТелоЗапроса.Вставить("bilUserPassword", НастройкиAPI.ПарольФТП);
	ТелоЗапроса.Вставить("isTransact", ?(ПолнаяВыгрузка, 0, 1));
	ТелоЗапроса.Вставить("prices", МассивЦен);

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИсточникЗаказов", Источник);
	ПараметрыЗапроса.Вставить("Метод", "POST");
	ПараметрыЗапроса.Вставить("Адрес", эв_ОбменСПорталамиСервер.БазовыйАдресAPI(НастройкиAPI) + "/Price/WPrice/WimportPrices");
	ПараметрыЗапроса.Вставить("Контур", ?(ПолнаяВыгрузка, "pricesFull", "pricesInc"));
	ПараметрыЗапроса.Вставить("Тело", ТелоЗапроса);
	ПараметрыЗапроса.Вставить("ПарольФТПДляМаскировки", НастройкиAPI.ПарольФТП);

	РезультатHTTP = эв_ОбменСПорталамиСервер.ВыполнитьЗапросHTTP(ПараметрыЗапроса);
	Если Не РезультатHTTP.Успех Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.АптекаМос", УровеньЖурналаРегистрации.Ошибка, , Источник,
			РезультатHTTP.ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;

	эв_ОбменСПорталамиСервер.ОбновитьСнимокОстатков(Источник, ТаблицаКОтправке, ПолнаяВыгрузка);
	Возврат Истина;

КонецФункции

Функция ЗагрузитьЗаказы(Источник, НастройкиAPI) Экспорт

	ТаблицаЗагруженных = НоваяТаблицаЗагруженныхЗаказов();

	Если Не ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.АптекаМос", УровеньЖурналаРегистрации.Предупреждение, , Источник,
			"Не заполнены настройки API АптекаМос");
		Возврат ТаблицаЗагруженных;
	КонецЕсли;

	ДатаГраницы = эв_ОбменСПорталамиСервер.ДатаГраницыЗагрузкиЗаказов(Источник, "getOrders");
	Starts = эв_ОбменСПорталамиСервер.ДатаISOСмещением(ДатаГраницы);
	Starts = СтрЗаменить(Starts, "+", "%2B");

	АдресЗапроса = эв_ОбменСПорталамиСервер.БазовыйАдресAPI(НастройкиAPI)
		+ "/Order/Order/getOrders?bilUserLogin=" + КодироватьСтроку(НастройкиAPI.Логин, СпособКодированияСтроки.КодировкаURL)
		+ "&bilUserPassword=" + КодироватьСтроку(НастройкиAPI.Пароль, СпособКодированияСтроки.КодировкаURL)
		+ "&starts=" + Starts;

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИсточникЗаказов", Источник);
	ПараметрыЗапроса.Вставить("Метод", "GET");
	ПараметрыЗапроса.Вставить("Адрес", АдресЗапроса);
	ПараметрыЗапроса.Вставить("Контур", "getOrders");
	ПараметрыЗапроса.Вставить("Заголовки", Заголовки);
	ПараметрыЗапроса.Вставить("ПарольДляМаскировки", НастройкиAPI.Пароль);

	РезультатHTTP = эв_ОбменСПорталамиСервер.ВыполнитьЗапросHTTP(ПараметрыЗапроса);
	Если Не РезультатHTTP.Успех Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.АптекаМос", УровеньЖурналаРегистрации.Ошибка, , Источник,
			РезультатHTTP.ТекстОшибки);
		Возврат ТаблицаЗагруженных;
	КонецЕсли;

	ЗагрузитьЗаказыИзJSON(Источник, НастройкиAPI, РезультатHTTP.Json, ТаблицаЗагруженных);
	Возврат ТаблицаЗагруженных;

КонецФункции

Функция ОтправитьСтатус(ПараметрыОчереди, НастройкиAPI) Экспорт

	Результат = Новый Структура("Успех, ТекстОшибки", Ложь, "");

	Если Не ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		Результат.ТекстОшибки = "Не заполнены настройки API АптекаМос";
		Возврат Результат;
	КонецЕсли;

	НомерНаСайте = эв_ОбменСПорталамиСервер.НомерЗаказаНаСайте(ПараметрыОчереди.ЗаказПокупателя);
	Если Не ЗначениеЗаполнено(НомерНаСайте) Тогда
		Результат.ТекстОшибки = "Не найден номер заказа на портале";
		Возврат Результат;
	КонецЕсли;

	КодСтатуса = эв_ОбменСПорталамиСервер.КодСтатусаПортала(ПараметрыОчереди.ИсточникЗаказов, ПараметрыОчереди.СтатусЗаказа);
	Если Не ЗначениеЗаполнено(КодСтатуса) Тогда
		Результат.ТекстОшибки = "Не задан код статуса портала для состояния заказа";
		Возврат Результат;
	КонецЕсли;

	СуммаЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОчереди.ЗаказПокупателя, "СуммаДокумента");

	ПараметрСтатуса = Новый Структура;
	ПараметрСтатуса.Вставить("orderNum", НомерНаСайте);
	ПараметрСтатуса.Вставить("orderStat", КодСтатуса);
	ПараметрСтатуса.Вставить("orderRealSum", СуммаЗаказа);

	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ПараметрСтатуса);

	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("bilUserLogin", НастройкиAPI.Логин);
	ТелоЗапроса.Вставить("bilUserPassword", НастройкиAPI.Пароль);
	ТелоЗапроса.Вставить("params", МассивПараметров);

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИсточникЗаказов", ПараметрыОчереди.ИсточникЗаказов);
	ПараметрыЗапроса.Вставить("ЗаказПокупателя", ПараметрыОчереди.ЗаказПокупателя);
	ПараметрыЗапроса.Вставить("Метод", "POST");
	ПараметрыЗапроса.Вставить("Адрес", эв_ОбменСПорталамиСервер.БазовыйАдресAPI(НастройкиAPI) + "/Order/Order/setOrders");
	ПараметрыЗапроса.Вставить("Контур", "setOrders");
	ПараметрыЗапроса.Вставить("Тело", ТелоЗапроса);
	ПараметрыЗапроса.Вставить("ПарольДляМаскировки", НастройкиAPI.Пароль);

	РезультатHTTP = эв_ОбменСПорталамиСервер.ВыполнитьЗапросHTTP(ПараметрыЗапроса);
	Результат.Успех = РезультатHTTP.Успех;
	Результат.ТекстОшибки = РезультатHTTP.ТекстОшибки;
	Возврат Результат;

КонецФункции

Функция ДанныеПодключенияКорректны(НастройкиAPI) Экспорт

	Если ТипЗнч(НастройкиAPI) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ПолеНастройкиЗаполнено(НастройкиAPI, "Адрес")
		И ПолеНастройкиЗаполнено(НастройкиAPI, "Логин")
		И ПолеНастройкиЗаполнено(НастройкиAPI, "Пароль")
		И ПолеНастройкиЗаполнено(НастройкиAPI, "ЛогинФТП")
		И ПолеНастройкиЗаполнено(НастройкиAPI, "ПарольФТП")
		И ПолеНастройкиЗаполнено(НастройкиAPI, "merchant");

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолеНастройкиЗаполнено(НастройкиAPI, ИмяПоля)

	ЗначениеПоля = Неопределено;
	Если Не НастройкиAPI.Свойство(ИмяПоля, ЗначениеПоля) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ЗначениеЗаполнено(ЗначениеПоля);

КонецФункции

Функция ПолучитьОстаткиЦены(Источник, НастройкиAPI, ПолнаяВыгрузка)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Номенклатура КАК Номенклатура,
		|	Остатки.Характеристика КАК Характеристика,
		|	СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Склад
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(, СтруктурнаяЕдиница = &Склад) КАК Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура,
		|	Остатки.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Резервы.Номенклатура КАК Номенклатура,
		|	Резервы.Характеристика КАК Характеристика,
		|	СУММА(Резервы.КоличествоОстаток) КАК РезервОстаток
		|ПОМЕСТИТЬ ВТ_Резервы
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			СтруктурнаяЕдиница = &Склад
		|				И ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК Резервы
		|
		|СГРУППИРОВАТЬ ПО
		|	Резервы.Номенклатура,
		|	Резервы.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Склад.Номенклатура КАК Номенклатура,
		|	ВТ_Склад.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ВТ_Склад.КоличествоОстаток - ЕСТЬNULL(ВТ_Резервы.РезервОстаток, 0) < 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Склад.КоличествоОстаток - ЕСТЬNULL(ВТ_Резервы.РезервОстаток, 0)
		|	КОНЕЦ КАК ДоступныйОстаток,
		|	ВТ_Склад.Номенклатура.ор_ЕГК КАК ор_ЕГК,
		|	ВТ_Склад.Номенклатура.Наименование КАК Наименование,
		|	ВТ_Склад.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	ЕСТЬNULL(ВТ_Склад.Номенклатура.ЦеноваяГруппа.Наименование, """") КАК ЦеноваяГруппаНаименование,
		|	ВТ_Склад.Характеристика.ор_СрокГодности КАК СрокГодности
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	ВТ_Склад КАК ВТ_Склад
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Резервы КАК ВТ_Резервы
		|		ПО ВТ_Склад.Номенклатура = ВТ_Резервы.Номенклатура
		|			И ВТ_Склад.Характеристика = ВТ_Резервы.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Цены.Номенклатура КАК Номенклатура,
		|	Цены.Характеристика КАК Характеристика,
		|	МАКСИМУМ(Цены.Цена) КАК Цена
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦен = &ВидЦен) КАК Цены
		|
		|СГРУППИРОВАТЬ ПО
		|	Цены.Номенклатура,
		|	Цены.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.Номенклатура КАК Номенклатура,
		|	ВТ_Остатки.Характеристика КАК Характеристика,
		|	ВТ_Остатки.ДоступныйОстаток КАК ДоступныйОстаток,
		|	ВТ_Остатки.ор_ЕГК КАК ор_ЕГК,
		|	ВТ_Остатки.Наименование КАК Наименование,
		|	ВТ_Остатки.СрокГодности КАК СрокГодности,
		|	ВЫБОР
		|		КОГДА ВРЕГ(ВТ_Остатки.ЦеноваяГруппаНаименование) = ""ЭВАЛАР""
		|			ТОГДА ЕСТЬNULL(ЦеныБезХарактеристики.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(ЦеныСХарактеристикой.Цена, 0)
		|	КОНЕЦ КАК Цена
		|ПОМЕСТИТЬ ВТ_Текущие
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ЦеныБезХарактеристики
		|		ПО ВТ_Остатки.Номенклатура = ЦеныБезХарактеристики.Номенклатура
		|			И (ЦеныБезХарактеристики.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|			И (ВРЕГ(ВТ_Остатки.ЦеноваяГруппаНаименование) = ""ЭВАЛАР"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ЦеныСХарактеристикой
		|		ПО ВТ_Остатки.Номенклатура = ЦеныСХарактеристикой.Номенклатура
		|			И ВТ_Остатки.Характеристика = ЦеныСХарактеристикой.Характеристика
		|			И (ВРЕГ(ВТ_Остатки.ЦеноваяГруппаНаименование) <> ""ЭВАЛАР"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Снимок.Номенклатура КАК Номенклатура,
		|	Снимок.Характеристика КАК Характеристика,
		|	Снимок.Цена КАК Цена,
		|	Снимок.ДоступныйОстаток КАК ДоступныйОстаток
		|ПОМЕСТИТЬ ВТ_Снимок
		|ИЗ
		|	РегистрСведений.эв_ВыгруженныеОстаткиПорталов КАК Снимок
		|ГДЕ
		|	Снимок.ИсточникЗаказов = &Источник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_Текущие.Номенклатура, ВТ_Снимок.Номенклатура) КАК Номенклатура,
		|	ЕСТЬNULL(ВТ_Текущие.Характеристика, ВТ_Снимок.Характеристика) КАК Характеристика,
		|	ЕСТЬNULL(ВТ_Текущие.ДоступныйОстаток, 0) КАК ДоступныйОстаток,
		|	ЕСТЬNULL(ВТ_Текущие.Цена, ВТ_Снимок.Цена) КАК Цена,
		|	ЕСТЬNULL(ВТ_Текущие.ор_ЕГК, ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_Снимок.Номенклатура.ор_ЕГК, """") КАК СТРОКА(20))) КАК ор_ЕГК,
		|	ЕСТЬNULL(ВТ_Текущие.Наименование, ВТ_Снимок.Номенклатура.Наименование) КАК Наименование,
		|	ЕСТЬNULL(ВТ_Текущие.СрокГодности, ВТ_Снимок.Характеристика.ор_СрокГодности) КАК СрокГодности
		|ИЗ
		|	ВТ_Текущие КАК ВТ_Текущие
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Снимок КАК ВТ_Снимок
		|		ПО ВТ_Текущие.Номенклатура = ВТ_Снимок.Номенклатура
		|			И ВТ_Текущие.Характеристика = ВТ_Снимок.Характеристика
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ПолнаяВыгрузка
		|				ТОГДА ЕСТЬNULL(ВТ_Текущие.ДоступныйОстаток, 0) >= 1
		|			КОГДА ВТ_Снимок.Номенклатура ЕСТЬ NULL
		|				ТОГДА ЕСТЬNULL(ВТ_Текущие.ДоступныйОстаток, 0) >= 1
		|			ИНАЧЕ ЕСТЬNULL(ВТ_Текущие.ДоступныйОстаток, 0) <> ЕСТЬNULL(ВТ_Снимок.ДоступныйОстаток, 0)
		|					ИЛИ ЕСТЬNULL(ВТ_Текущие.Цена, 0) <> ЕСТЬNULL(ВТ_Снимок.Цена, 0)
		|		КОНЕЦ";

	Запрос.УстановитьПараметр("Склад", НастройкиAPI.Склад);
	Запрос.УстановитьПараметр("ВидЦен", НастройкиAPI.ВидЦен);
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("ПолнаяВыгрузка", ПолнаяВыгрузка);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция СформироватьМассивЦен(ТаблицаОстатков, НастройкиAPI, ТаблицаКОтправке)

	МассивЦен = Новый Массив;
	Для Каждого СтрокаОстатка Из ТаблицаОстатков Цикл

		КодЕГК = СтрЗаменить(СокрЛП(СтрокаОстатка.ор_ЕГК), " ", "");
		Если Не ЗначениеЗаполнено(КодЕГК) Или СтрокаОстатка.Цена = 0 Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ТаблицаКОтправке.Добавить(), СтрокаОстатка);

		Позиция = Новый Структура;
		Позиция.Вставить("org_id", СокрЛП(НастройкиAPI.merchant));
		Позиция.Вставить("drug_id", ПривестиКодЕГК(КодЕГК));
		Позиция.Вставить("item_id", XMLСтрока(СтрокаОстатка.Номенклатура));
		Позиция.Вставить("item_name", СокрЛП(СтрокаОстатка.Наименование));
		Позиция.Вставить("price", Цел(СтрокаОстатка.Цена));
		Позиция.Вставить("qtty", СтрокаОстатка.ДоступныйОстаток);
		Позиция.Вставить("reserv", 1);

		Если ЗначениеЗаполнено(СтрокаОстатка.СрокГодности) Тогда
			Позиция.Вставить("item_code", Формат(СтрокаОстатка.СрокГодности, "ДФ=dd.MM.yyyy"));
		КонецЕсли;

		МассивЦен.Добавить(Позиция);

	КонецЦикла;

	Возврат МассивЦен;

КонецФункции

Функция ПривестиКодЕГК(КодЕГК)

	Попытка
		Возврат Число(КодЕГК);
	Исключение
		Возврат КодЕГК;
	КонецПопытки;

КонецФункции

Процедура ЗагрузитьЗаказыИзJSON(Источник, НастройкиAPI, ДанныеJSON, ТаблицаЗагруженных)

	МассивЗаказов = ЗначениеПоляJSON(ДанныеJSON, "orders");
	Если ТипЗнч(МассивЗаказов) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторАптеки = 0;
	Попытка
		ИдентификаторАптеки = Число(СокрЛП(НастройкиAPI.merchant));
	Исключение
		ЗаписьЖурналаРегистрации("Обмен с порталами.АптекаМос", УровеньЖурналаРегистрации.Ошибка, , Источник,
			"Некорректный merchant: " + НастройкиAPI.merchant);
		Возврат;
	КонецПопытки;

	СтатусНовый = эв_ОбменСПорталамиСервер.СостояниеНовыйЗаказа(НастройкиAPI.Вид);

	Для Каждого ОбъектЗаказа Из МассивЗаказов Цикл

		orgId = ЧислоИзJSON(ЗначениеПоляJSON(ОбъектЗаказа, "orgId"));
		Если orgId <> ИдентификаторАптеки Тогда
			Продолжить;
		КонецЕсли;

		НомерНаСайте = СтрЗаменить(СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(ОбъектЗаказа, "orderNum"))), Символы.НПП, "");
		Если Не ЗначениеЗаполнено(НомерНаСайте) Тогда
			Продолжить;
		КонецЕсли;

		СуществующийЗаказ = эв_ОбменСПорталамиСервер.НайтиЗаказПоНомеруНаСайте(НомерНаСайте, Источник);
		Если ЗначениеЗаполнено(СуществующийЗаказ) Тогда
			ДобавитьСтрокуЗагруженных(ТаблицаЗагруженных, СуществующийЗаказ, НомерНаСайте, Ложь);
			Продолжить;
		КонецЕсли;

		ДанныеЗаказа = РазобратьЗаказJSON(ОбъектЗаказа, НомерНаСайте);
		Попытка
			ЗаказСсылка = эв_ОбменСПорталамиСервер.СоздатьЗаказПортала(Источник, НастройкиAPI, ДанныеЗаказа);
		Исключение
			ЗаписьЖурналаРегистрации("Обмен с порталами.АптекаМос", УровеньЖурналаРегистрации.Ошибка, , Источник,
				СтрШаблон("Ошибка создания заказа %1: %2", НомерНаСайте, ОписаниеОшибки()));
			Продолжить;
		КонецПопытки;

		Если Не ЗначениеЗаполнено(ЗаказСсылка) Тогда
			Продолжить;
		КонецЕсли;

		ДобавитьСтрокуЗагруженных(ТаблицаЗагруженных, ЗаказСсылка, НомерНаСайте, Истина);

		Если ЗначениеЗаполнено(СтатусНовый) Тогда
			эв_ОбменСПорталамиСервер.ПоставитьЗаказВОчередьСтатусов(ЗаказСсылка, Источник, СтатусНовый, , Истина);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция РазобратьЗаказJSON(ОбъектЗаказа, НомерНаСайте)

	ФИО = РазобратьФИО(СтрокаИзJSON(ЗначениеПоляJSON(ОбъектЗаказа, "custFullName")));

	Комментарии = Новый Массив;
	ДобавитьНепустойКомментарий(Комментарии, ЗначениеПоляJSON(ОбъектЗаказа, "custComment"));
	ДобавитьНепустойКомментарий(Комментарии, ЗначениеПоляJSON(ОбъектЗаказа, "orderStatComment"));
	ДобавитьНепустойКомментарий(Комментарии, ЗначениеПоляJSON(ОбъектЗаказа, "operComment"));

	ДанныеЗаказа = Новый Структура;
	ДанныеЗаказа.Вставить("НомерНаСайте", НомерНаСайте);
	ДанныеЗаказа.Вставить("Дата", ДатаИзJSON(ЗначениеПоляJSON(ОбъектЗаказа, "orderTime")));
	ДанныеЗаказа.Вставить("Фамилия", ФИО.Фамилия);
	ДанныеЗаказа.Вставить("Имя", ФИО.Имя);
	ДанныеЗаказа.Вставить("Отчество", ФИО.Отчество);
	ДанныеЗаказа.Вставить("Почта", СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(ОбъектЗаказа, "custEmail"))));
	ДанныеЗаказа.Вставить("Телефон", ПривестиТелефон(СтрокаИзJSON(ЗначениеПоляJSON(ОбъектЗаказа, "custPhone"))));
	ДанныеЗаказа.Вставить("Комментарий", СтрСоединить(Комментарии, Символы.ПС));
	ДанныеЗаказа.Вставить("Сумма", ЧислоИзJSON(ЗначениеПоляJSON(ОбъектЗаказа, "orderRealSum")));
	ДанныеЗаказа.Вставить("ИсходныйПакетJSON", "");
	ДанныеЗаказа.Вставить("Товары", Новый Массив);

	Попытка
		ДанныеЗаказа.ИсходныйПакетJSON = КоннекторHTTP.ОбъектВJson(ОбъектЗаказа);
	Исключение
		ДанныеЗаказа.ИсходныйПакетJSON = "";
	КонецПопытки;

	Позиции = ЗначениеПоляJSON(ОбъектЗаказа, "positions");
	Если ТипЗнч(Позиции) <> Тип("Массив") Тогда
		Возврат ДанныеЗаказа;
	КонецЕсли;

	Для Каждого ОбъектПозиции Из Позиции Цикл

		ИдПозиции = СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(ОбъектПозиции, "itemId")));
		СтрокаТовара = Новый Структура;
		СтрокаТовара.Вставить("ИдПозиции", ИдПозиции);
		СтрокаТовара.Вставить("Номенклатура", эв_ОбменСПорталамиСервер.НоменклатураПоИдентификаторуПортала(ИдПозиции));
		СтрокаТовара.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		СтрокаТовара.Вставить("Количество", ЧислоИзJSON(ЗначениеПоляJSON(ОбъектПозиции, "qtty")));
		СтрокаТовара.Вставить("Цена", ЧислоИзJSON(ЗначениеПоляJSON(ОбъектПозиции, "price")));
		СтрокаТовара.Вставить("Наименование", СтрокаИзJSON(ЗначениеПоляJSON(ОбъектПозиции, "itemName")));
		ДанныеЗаказа.Товары.Добавить(СтрокаТовара);

	КонецЦикла;

	Возврат ДанныеЗаказа;

КонецФункции

Функция РазобратьФИО(ПолноеИмя)

	Результат = Новый Структура("Фамилия, Имя, Отчество", "", "", "");
	ЧастиИмени = СтрРазделить(СокрЛП(ПолноеИмя), " ", Ложь);
	Если ЧастиИмени.Количество() > 0 Тогда
		Результат.Фамилия = ЧастиИмени[0];
	КонецЕсли;
	Если ЧастиИмени.Количество() > 1 Тогда
		Результат.Имя = ЧастиИмени[1];
	КонецЕсли;
	Если ЧастиИмени.Количество() > 2 Тогда
		ОтчествоЧасти = Новый Массив;
		Для Индекс = 2 По ЧастиИмени.Количество() - 1 Цикл
			ОтчествоЧасти.Добавить(ЧастиИмени[Индекс]);
		КонецЦикла;
		Результат.Отчество = СтрСоединить(ОтчествоЧасти, " ");
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ПривестиТелефон(Телефон)

	Цифры = "";
	Для НомерСимвола = 1 По СтрДлина(Телефон) Цикл
		Символ = Сред(Телефон, НомерСимвола, 1);
		Если СтрНайти("0123456789", Символ) > 0 Тогда
			Цифры = Цифры + Символ;
		КонецЕсли;
	КонецЦикла;

	Если СтрДлина(Цифры) = 11 И Лев(Цифры, 1) = "8" Тогда
		Цифры = "7" + Сред(Цифры, 2);
	ИначеЕсли СтрДлина(Цифры) = 10 Тогда
		Цифры = "7" + Цифры;
	КонецЕсли;

	Возврат Цифры;

КонецФункции

Функция НоваяТаблицаЗагруженныхЗаказов()

	ТаблицаЗагруженных = Новый ТаблицаЗначений;
	ТаблицаЗагруженных.Колонки.Добавить("ЗаказПокупателя", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	ТаблицаЗагруженных.Колонки.Добавить("НомерЗаказаНаСайте", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаЗагруженных.Колонки.Добавить("ЭтоНовый", Новый ОписаниеТипов("Булево"));
	Возврат ТаблицаЗагруженных;

КонецФункции

Процедура ДобавитьСтрокуЗагруженных(ТаблицаЗагруженных, ЗаказПокупателя, НомерНаСайте, ЭтоНовый)

	СтрокаТаблицы = ТаблицаЗагруженных.Добавить();
	СтрокаТаблицы.ЗаказПокупателя = ЗаказПокупателя;
	СтрокаТаблицы.НомерЗаказаНаСайте = НомерНаСайте;
	СтрокаТаблицы.ЭтоНовый = ЭтоНовый;

КонецПроцедуры

Процедура ДобавитьНепустойКомментарий(Комментарии, ЗначениеКомментария)

	Текст = СокрЛП(СтрокаИзJSON(ЗначениеКомментария));
	Если ЗначениеЗаполнено(Текст) Тогда
		Комментарии.Добавить(Текст);
	КонецЕсли;

КонецПроцедуры

Функция ЗначениеПоляJSON(ОбъектJSON, ИмяПоля)

	Если ТипЗнч(ОбъектJSON) = Тип("Соответствие") Тогда
		Возврат ОбъектJSON.Получить(ИмяПоля);
	ИначеЕсли ТипЗнч(ОбъектJSON) = Тип("Структура") Тогда
		ЗначениеПоля = Неопределено;
		ОбъектJSON.Свойство(ИмяПоля, ЗначениеПоля);
		Возврат ЗначениеПоля;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция СтрокаИзJSON(ЗначениеПоля)

	Если ЗначениеПоля = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Возврат СокрЛП(Строка(ЗначениеПоля));

КонецФункции

Функция ЧислоИзJSON(ЗначениеПоля)

	Если ЗначениеПоля = Неопределено Или ЗначениеПоля = "" Тогда
		Возврат 0;
	КонецЕсли;
	Если ТипЗнч(ЗначениеПоля) = Тип("Число") Тогда
		Возврат ЗначениеПоля;
	КонецЕсли;
	Попытка
		Возврат Число(ЗначениеПоля);
	Исключение
		Возврат 0;
	КонецПопытки;

КонецФункции

Функция ДатаИзJSON(ЗначениеПоля)

	Если ТипЗнч(ЗначениеПоля) = Тип("Дата") Тогда
		Возврат ЗначениеПоля;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЗначениеПоля) Тогда
		Возврат ТекущаяДатаСеанса();
	КонецЕсли;
	Попытка
		Возврат ПрочитатьДатуJSON(Строка(ЗначениеПоля), ФорматДатыJSON.ISO);
	Исключение
		Возврат ТекущаяДатаСеанса();
	КонецПопытки;

КонецФункции

#КонецОбласти
